<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"9cd6af86123d5750d5b89a642b4988438bdb91e08381662eda415a49d3e795d5","plan_job_ref":"Job Create terraform plan #14 at https://github.com/Clac9queur/LaCourDesPetitsCurieux-LCDPC/actions/runs/5155457091","plan_hash":"ba2a38d1248ab77ae1adb225faa3d05d16db86979990af27d5f0d9eade2a175a","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan in __./back/operations/terraform__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_pod.test will be created
  + resource "kubernetes_pod" "test" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "test"
          + namespace        = "lacoursdespetitscurieux"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + automount_service_account_token  = true
          + dns_policy                       = "ClusterFirst"
          + enable_service_links             = true
          + host_ipc                         = false
          + host_network                     = false
          + host_pid                         = false
          + hostname                         = (known after apply)
          + node_name                        = (known after apply)
          + restart_policy                   = "Always"
          + scheduler_name                   = (known after apply)
          + service_account_name             = (known after apply)
          + share_process_namespace          = false
          + termination_grace_period_seconds = 30

          + container {
              + image                      = "httpd"
              + image_pull_policy          = (known after apply)
              + name                       = "test"
              + stdin                      = false
              + stdin_once                 = false
              + termination_message_path   = "/dev/termination-log"
              + termination_message_policy = (known after apply)
              + tty                        = false
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #14](https://github.com/Clac9queur/LaCourDesPetitsCurieux-LCDPC/actions/runs/5155457091)